Repository: archriss/TYPO3-arc_export
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: fr

# be.admin
source: Remember to create a sys folder to store copy of file, and parameter your extensions.
fr: N'oubliez pas de créer le sys folder pour stocker la copie des fichiers, et paramétrez vos extensions.

# be.adminTS
source: TS must be define in order to declare wich domain/model will let us get data export. This example show standard configuration. Repository is automaticaly calculated, but can be specified using "repository" key.
fr: Le TS doit être défini pour déclarer quel domain/model permettra l'export de données. Cet exemple montre une configuration standard. Le repository est automatiquement calculé, mais peut être spécifié en utilisant la clé "repository".

# be.adminTMPL
source: Export use standard default template in order to display all field in TCA/table/interface/showRecordFieldList. Date field are parsed, but relation to other table not yet.
fr: L'export utilise un template standard par default pour afficher les champs de TCA/table/interface/showRecordFieldList. Les date sont parsé, mais les relations vers d'autres table ne le sont pas encore.

# be.adminFILE
source: Storage folder must be create in order to store all exported file on the server.
fr: Le dossier de stockage doit être créé pour pouvoir stocker tous les export fichier sur le serveur.

# be.adminEXPORTED
source: Domain/Repository should contain 2 functions in order to get exported limitation to work (findByExported / countByExported). This able to export only non exported data. Field name must be the same declared in TYPOSCRIPT upper.
fr: Le Domain/Repository devrait contenir 2 fonctions pour pouvoir procéder au export limité (findByExported / countByExported). Cela permet d'exporter uniquement les données qui ne l'ont pas encore été. Le nom du champ doit être le même que celui déclaré dans le TYPOSCRIPT plus haut.

# be.adminEXPORTEDPic
source: This enable the module to display information circle in red in the picture bellow.
fr: Cela permet au module d'afficher les informations en rouge dans l'image ci dessous.

# be.select
source: Select data to export bellow
fr: Sélectionnez les données à exporter ci-dessous

# be.title
source: Data export
fr: Export de données

# be.reload
source: Reload
fr: Recharger

# be.selectpage
source: Please select a table to export in select menu in the header
fr: Sélectionnez une table à exporter dans le sélecteur de menu dans le header

# be.warning
source: <span class="important">Warning:</span> Only table with data in this page will be displayed.
fr: <span class="important">Attention:</span> Seul les tables proposant des données dans cette page seront affiché.

# be.tableAvailable
source: Following datas are available for export:
fr: Les données suivantes sont disponibles pour un export:

# be.tableAvailable.canBeSelected
source: Can be selected
fr: Peut être sélectionné

# be.record.total
source: There's %d total records in this page.
fr: Il y a dans cette page %d enregistrement(s) au total.

# be.record.exported
source: There's %d unexported records in this page.
fr: Il y a dans cette page %d enregistrement(s) non exporté(s).

# be.record.unable
source: Unable to calculate number of unexported records in this page.
fr: Il n'est pas possible de déterminer le nombre d'élément non exporté dans cette page.

# be.submit.total
source: Export all records
fr: Exporter tous les enregistrements

# be.submit.exported
source: Export unexported records and mark them as exported.
fr: Exporter les enregistrements non exporté(s) et les marquer déjà exporté(s)

# be.filelist
source: File list (last one on the top)
fr: Liste des fichiers (les derniers en haut)

# be.filelist.doNotStart
source: If your download do not start automaticaly, you can click on the green file name, it's your download.
fr: Si le téléchargement ne démarre pas automatiquement, vous pouvez cliquer sur le fichier en vert, c'est votre téléchargement.

# be.filelist.hint
source: File name (date) - size
fr: nom du fichier (date) - taille
